[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:45:34
           id="itemId"
           type="number"
           isInvalid={Boolean(errors.itemId)}
-          {...register("itemId", {
-            required: "itemId is required.",
-            maxLength: {
-              value: 30,
-              message: "itemId: Max length 30 characters",
-            },
-            min: {
-              value: 0,
-              message: "itemId: must be at least 0",
-            },
-          })}
+          {...register("itemId", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /itemId is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:49:24
             required: "itemId is required.",
             maxLength: {
               value: 30,
-              message: "itemId: Max length 30 characters",
+              message: "",
             },
             min: {
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /itemId: Max length 30 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:51:18
               value: 30,
               message: "itemId: Max length 30 characters",
             },
-            min: {
-              value: 0,
-              message: "itemId: must be at least 0",
-            },
+            min: {},
           })}
         />
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /itemId: must be at least 0/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:70:23
           type="text"
           isInvalid={Boolean(errors.reviewerEmail)}
           {...register("reviewerEmail", {
-            required: "reviewerEmail is required.",
+            required: "",
             maxLength: {
               value: 255,
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /reviewerEmail is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:71:24
           isInvalid={Boolean(errors.reviewerEmail)}
           {...register("reviewerEmail", {
             required: "reviewerEmail is required.",
-            maxLength: {
-              value: 255,
-              message: "reviewerEmail: Max length 255 characters",
-            },
+            maxLength: {},
           })}
         />
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /reviewerEmail: Max length 255 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:89:33
           id="stars"
           type="number"
           isInvalid={Boolean(errors.stars)}
-          {...register("stars", {
-            required: "stars is required.",
-            min: {
-              value: 0,
-              message: "Stars must be at least 0",
-            },
-            max: {
-              value: 5,
-              message: "Stars must be at most 5",
-            },
-          })}
+          {...register("stars", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /stars is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:91:18
           isInvalid={Boolean(errors.stars)}
           {...register("stars", {
             required: "stars is required.",
-            min: {
-              value: 0,
-              message: "Stars must be at least 0",
-            },
+            min: {},
             max: {
               value: 5,
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Stars must be at least 0/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:93:24
             required: "stars is required.",
             min: {
               value: 0,
-              message: "Stars must be at least 0",
+              message: "",
             },
             max: {
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Stars must be at least 0/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:115:24
           isInvalid={Boolean(errors.comments)}
           {...register("comments", {
             required: "comments are required.",
-            maxLength: {
-              value: 255,
-              message: "comments: Max length 255 characters",
-            },
+            maxLength: {},
           })}
         />
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /comments: Max length 255 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
