[Killed] BlockStatement
main/components/MenuItemReviews/MenuItemReviewTable.js:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/menuItemReview/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: MenuItemReviewTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/menuItemReview/edit/1"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewTable.js:20:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/menuItemReview/edit/${cell.row.values.id}`);
+    navigate(``);
   };
 
killedBy: MenuItemReviewTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/menuItemReview/edit/1"
Received: ""

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewTable.js:55:5
       Header: "Stars",
       accessor: "stars",
     },
-    {
-      Header: "Comments",
-      accessor: "comments",
-    },
+    {},
     {
       Header: "DateReviewed",
killedBy: MenuItemReviewIndexPage tests Renders with Create Button for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewTable.js:59:5
       Header: "Comments",
       accessor: "comments",
     },
-    {
-      Header: "DateReviewed",
-      accessor: "dateReviewed",
-    },
+    {},
   ];
 
killedBy: MenuItemReviewTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!
