[Killed] ArrowFunction
main/pages/MenuItemReview/MenuItemReviewCreatePage.js:8:31
 import { toast } from "react-toastify";
 
 export default function MenuItemReviewCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (menuItemReview) => ({
-    url: "/api/menuItemReview/post",
-    method: "POST",
-    params: {
-      itemId: menuItemReview.itemId,
-      reviewerEmail: menuItemReview.reviewerEmail,
-      stars: menuItemReview.stars,
-      comments: menuItemReview.comments,
-      dateReviewed: menuItemReview.dateReviewed,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (menuItemReview) => {
killedBy: MenuItemReviewCreatePage tests on submit, makes request to backend, and redirects to /menuItemReview
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/pages/MenuItemReview/MenuItemReviewCreatePage.js:39:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/menuItemReview" />;
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: MenuItemReviewCreatePage tests on submit, makes request to backend, and redirects to /menuItemReview
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/menuItemReview"}

Number of calls: 0
