[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:45:34
           id="itemId"
           type="number"
           isInvalid={Boolean(errors.itemId)}
-          {...register("itemId", {
-            required: "itemId is required.",
-            maxLength: {
-              value: 30,
-              message: "itemId: Max length 30 characters",
-            },
-          })}
+          {...register("itemId", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /itemId is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:91:18
               value: 0,
               message: "Stars must be at least 0",
             },
-            max: {
-              value: 5,
-              message: "Stars must be at most 5",
-            },
+            max: {},
           })}
         />
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Stars must be at most 5/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:93:24
             },
             max: {
               value: 5,
-              message: "Stars must be at most 5",
+              message: "",
             },
           })}
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Stars must be at most 5/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
