[Survived] ArrayDeclaration
src/main/components/OurTable.js:6:10
 
 export default function OurTable({
   columns = [],
-  data = [],
+  data = ["Stryker was here"],
   testid = "testid",
 }) {

[Killed] StringLiteral
src/main/components/OurTable.js:30:36
                 key={`${testid}-header-${column.id}`}
               >
                 {column.render("Header")}
-                <span data-testid={`${testid}-header-${column.id}-sort-carets`}>
+                <span data-testid={``}>
                   {column.isSorted ? (column.isSortedDesc ? " 🔽" : " 🔼") : ""}
                 </span>
killedBy: OurTable tests click on a header and a sort caret should appear
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="sampleTestId-header-col1-sort-carets"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
src/main/components/OurTable.js:31:69
               >
                 {column.render("Header")}
                 <span data-testid={`${testid}-header-${column.id}-sort-carets`}>
-                  {column.isSorted ? (column.isSortedDesc ? " 🔽" : " 🔼") : ""}
+                  {column.isSorted ? (column.isSortedDesc ? " 🔽" : """: ""}
                 </span>
               </th>
killedBy: OurTable tests click on a header and a sort caret should appear
statusReason: Error: Unable to find an element with the text: 🔼. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
