[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:46:23
           type="text"
           isInvalid={Boolean(errors.orgCode)}
           {...register("orgCode", {
-            required: "Org Code is required.",
+            required: "",
             maxLength: {
               value: 255,
killedBy: UCSBOrganizationsForms tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Org Code is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:47:24
           isInvalid={Boolean(errors.orgCode)}
           {...register("orgCode", {
             required: "Org Code is required.",
-            maxLength: {
-              value: 255,
-              message: "Max length 255 characters",
-            },
+            maxLength: {},
           })}
         />
killedBy: UCSBOrganizationsForms tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Max length 255 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:66:47
           id="orgTranslationShort"
           type="text"
           isInvalid={Boolean(errors.orgTranslationShort)}
-          {...register("orgTranslationShort", {
-            required: "Org Translation Short is required.",
-          })}
+          {...register("orgTranslationShort", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationsForms tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Org Translation Short is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:94:24
           type="checkbox"
           id="inactive"
           label="Inactive"
-          {...register("inactive")}
+          {...register("")}
         />
       </Form.Group>
killedBy: UCSBOrganizationsForms tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
