[Killed] BlockStatement
main/components/UCSBOrganizations/UCSBOrganizationsTable.js:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/UCSBOrganizations/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UCSBOrganizationsTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/UCSBOrganizations/edit/4"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationsTable.js:45:17
 
     {
       Header: "Organization Code",
-      accessor: "orgCode",
+      accessor: "",
     },
     {
killedBy: UCSBOrganizationsTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBOrganizationsTable-cell-row-0-col-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationsTable.js:49:17
     },
     {
       Header: "Organization Translation Short",
-      accessor: "orgTranslationShort",
+      accessor: "",
     },
     {
killedBy: UCSBOrganizationsTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBOrganizationsTable-cell-row-0-col-orgTranslationShort"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/UCSBOrganizations/UCSBOrganizationsTable.js:55:5
       Header: "Organization Translation",
       accessor: "orgTranslation",
     },
-    {
-      Header: "Inactive",
-      accessor: "inactive",
-    },
+    {},
   ];
 
killedBy: UCSBOrganizationsTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!
