[Killed] BlockStatement
src/main/utils/ucsbOrganizationsUtils.js:8:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/ucsborganizations",
-    method: "DELETE",
-    params: {
-      id: cell.row.values.id,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: UCSBOrganizationsTable tests Delete button calls delete callback
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
src/main/utils/ucsbOrganizationsUtils.js:9:10
 }
 
 export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/ucsborganizations",
-    method: "DELETE",
-    params: {
-      id: cell.row.values.id,
-    },
-  };
+  return {};
 }
 
killedBy: UCSBOrganizationsTable tests Delete button calls delete callback
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
src/main/utils/ucsbOrganizationsUtils.js:12:13
   return {
     url: "/api/ucsborganizations",
     method: "DELETE",
-    params: {
-      id: cell.row.values.id,
-    },
+    params: {},
   };
 }
killedBy: ucsbOrganizationUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

  Object {
    "method": "DELETE",
-   "params": Object {
